
# З Titanic Dataset Exploration with pandas

 **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why its useful.

In [1]:
import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

##  Step 1: Inspecting the Data

### df.head() y df.tail()
Estos m茅todos son 煤tiles para extaer informaci贸n del comienzo y el final de las series o dataframes respectivamente. Se usan para hacerse una idea r谩pida sobre un dataset. Harrison prefire usar `df.sample()` para hacerse una idea m谩s real sobre los datos, ya que **las filas iniciales no suelen ser representativas**.

In [2]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [4]:
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
524,525,0,3,"Kassem, Mr. Fared",male,NaN,0,0,2700,7.2292,NaN,C
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
37,38,0,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S
72,73,0,2,"Hood, Mr. Ambrose Jr",male,21.0,0,0,S.O.C. 14879,73.5000,NaN,S
246,247,0,3,"Lindahl, Miss. Agda Thorilda Viktoria",female,25.0,0,0,347071,7.7750,NaN,S

### df.info()
Imprime por la salida estandar informaci贸n 煤til sobre el DataFrame en cuanto a estructura de datos: columnas, indices, tipos, tapa帽os etc. Un parametro importante es `memory_usage`.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 285.6 KB

### df.describe()
El m茅todo devuelve un DataFrame con informaci贸n estad铆stica de cada columna num茅rica, siendo pedantes, es una meta-agregaci贸n.

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### df.shape
Devuelve una tupla con la dimensionalidad del DataFrame.

In [8]:
df.shape

(891, 12)

### df.columns
Este atributo devuelve las etiquetas de las columnas del DataFrame.

In [9]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

##  Step 2: Selecting Data
Las Series y los DataFrames en pandas implementan el operador de indexaci贸n de python `[]`, a la vez permiten indexar contra sus atributos `loc`y `矛loc`.

### df["column"]
Uno de los m茅todos para acceder a las columnas es indexarlas directamente desde el objeto. Igualmente podemos acceder a ellas directamente c贸mo un atributo, pero unicamente si el nombre de la columna es un nombre v谩lido par aun atributo en python. **Muchas referencias recomiendan ignorar tanto las columnas c贸mo atributo c贸mo indexar directamente desde el objeto en favor de loc y iloc**.

In [10]:
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [11]:
df["Age"] #Ambos devuelven una serie

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

El operador `[]` tiene un comportamiento diferente en Series y en DataFrames, en las series apela al indice mientras que en el Frame espera el nombre de una tabla.

In [12]:
#df[4] genera un error clave no encontrada
df["Age"][4]

np.float64(35.0)

Cuando indexamos una unica columna, podemos **forzar que nos devueva un DataFrame** indexando una lista en vez de un escalar.

In [13]:
df[["Age"]] #No podr铆amos indexar c贸mo arriba

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

Podmeos indexar m谩s de una columna mediante una lista. Esta vez nos ha devuelto un dataframe no una serie, ya que tiene m谩s de una columna
.

In [14]:
df[["Age", "Sex"]]

      Age     Sex
0    22.0    male
1    38.0  female
2    26.0  female
3    35.0  female
4    35.0    male
..    ...     ...
886  27.0    male
887  19.0  female
888   NaN  female
889  26.0    male
890  32.0    male

[891 rows x 2 columns]

### df.iloc[]
El atributo iloc nos permite extraer filas y columnas mediante su posici贸n.

In [15]:
df.iloc[4] #Es una Serie aunque es una fila!!!

PassengerId                           5
Survived                              0
Pclass                                3
Name           Allen, Mr. William Henry
Sex                                male
Age                                35.0
SibSp                                 0
Parch                                 0
Ticket                           373450
Fare                               8.05
Cabin                               NaN
Embarked                              S
Name: 4, dtype: object

In [16]:
df.iloc[[4]] #Al indexar de nuevo sobre una lista, el objeto devuelto es un DataFrame

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

Al igual que en python, podemos pasarle un "slice" o incluso una funci贸n, que reciva un DataFrame y devuelva opciones v谩lidas para `iloc`.

In [17]:
df.iloc[0:11:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

In [18]:
df.iloc[(lambda df:[0,5,10])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S

Y manteniendo la l贸gica de las operaciones anteriores, podemos extraer igualmente columnas.

In [19]:
df.iloc[:,[3]]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
886                              Montvila, Rev. Juozas
887                       Graham, Miss. Margaret Edith
888           Johnston, Miss. Catherine Helen "Carrie"
889                              Behr, Mr. Karl Howell
890                                Dooley, Mr. Patrick

[891 rows x 1 columns]

A pesar de su naturaleza posicional, `iloc` permite indexar mediante un array Numpy de booleanos. *Una serie de pandas, dar谩 error*.

In [20]:
df.iloc[(df.Age>18).to_numpy()].sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
614,615,0,3,"Brocklebank, Mr. William Alfred",male,35.0,0,0,364512,8.0500,NaN,S
379,380,0,3,"Gustafsson, Mr. Karl Gideon",male,19.0,0,0,347069,7.7750,NaN,S
341,342,1,1,"Fortune, Miss. Alice Elizabeth",female,24.0,3,2,19950,263.0000,C23 C25 C27,S
296,297,0,3,"Hanna, Mr. Mansour",male,23.5,0,0,2693,7.2292,NaN,C
188,189,0,3,"Bourke, Mr. John",male,40.0,1,1,364849,15.5000,NaN,Q

### df.loc[]
El atributo loc nos permite indexar por el nombre del indice y de la columna. Es mportante recordar en este punto que los indices, aunque sean numericos autoincrementales, **son etiquetas no posiciones**.

In [21]:
df.loc[50:100:10, ["Name", "Sex", "Pclass"]]

                           Name     Sex  Pclass
50   Panula, Master. Juha Niilo    male       3
60        Sirayanian, Mr. Orsen    male       3
70   Jenkin, Mr. Stephen Curnow    male       2
80         Waelens, Mr. Achille    male       3
90         Christmann, Mr. Emil    male       3
100     Petranec, Miss. Matilda  female       3

`loc` puede indexar sobre un array de booleanos, es decir **una serie cuyo indice coincide con el del dataframe o la serie sobre la que se aplica la operaci贸n de indexado**,es m谩s c贸modo que `iloc`.

In [22]:
df.loc[df.Age>18].sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
197,198,0,3,"Olsen, Mr. Karl Siegwart Andreas",male,42.0,0,1,4579,8.4042,NaN,S
288,289,1,2,"Hosono, Mr. Masabumi",male,42.0,0,0,237798,13.0000,NaN,S
577,578,1,1,"Silvey, Mrs. William Baird (Alice Munger)",female,39.0,1,0,13507,55.9000,E44,S
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
774,775,1,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.0000,NaN,S

Fijate que el comportamiento de `iloc` y `loc` al definir intervalos es diferente. `iloc` implementa una l贸gica de intervalo medio abierto, incluyendo el primer indice pero no el 煤ltimo; mientras que `loc`implementa un intervalo cerrado, incluyendo tanto el primer indice c贸mo el 煤ltimo. Hay excepciones c贸mo la indexaci贸n parcial que hace que esta l贸gica se sienta algo inconssitente.

In [23]:
df.iloc[50:100:10] #el mismo intervalo pero con iloc, observa la diferencia.

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
60,61,0,3,"Sirayanian, Mr. Orsen",male,22.0,0,0,2669,7.2292,NaN,C
70,71,0,2,"Jenkin, Mr. Stephen Curnow",male,32.0,0,0,C.A. 33111,10.5000,NaN,S
80,81,0,3,"Waelens, Mr. Achille",male,22.0,0,0,345767,9.0000,NaN,S
90,91,0,3,"Christmann, Mr. Emil",male,29.0,0,0,343276,8.0500,NaN,S

Podemos hacer indexaci贸n por rango en indices de strings, incluso podemos hacer una **indexaci贸n parcial**, pero los indices deben estar *ordenados*.

In [24]:
df.set_index("Embarked").sort_index().loc['C':'Q']

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
Embarked,,,,,,,,,,,
C,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN
C,126,1,3,"Nicola-Yarred, Master. Elias",male,12.0,1,0,2651,11.2417,NaN
C,355,0,3,"Yousif, Mr. Wazli",male,NaN,0,0,2647,7.2250,NaN
C,353,0,3,"Elias, Mr. Tannous",male,15.0,1,1,2695,7.2292,NaN
C,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69
...,...,...,...,...,...,...,...,...,...,...,...
Q,209,1,3,"Carr, Miss. Helen ""Ellen""",female,16.0,0,0,367231,7.7500,NaN
Q,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN
Q,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN
Q,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN
Q,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN

In [25]:
#Muy 煤til para seleccionar largas listas de nombres.Aqu铆 extraemos los apellidos de la A a la C.
#Importante destacar que se la indexaci贸n parcial excluye el ultimo indice: los apellidos empezados por D no aparecen.
df.set_index('Name').sort_index().loc["A":"D", "PassengerId":"Pclass"]

,PassengerId,Survived,Pclass
Name,,,
"Abbing, Mr. Anthony",846,0,3
"Abbott, Mr. Rossmore Edward",747,0,3
"Abbott, Mrs. Stanton (Rosa Hunt)",280,1,3
"Abelson, Mr. Samuel",309,0,2
"Abelson, Mrs. Samuel (Hannah Wizosky)",875,1,2
...,...,...,...
"Crosby, Capt. Edward Gifford",746,0,1
"Crosby, Miss. Harriet R",541,1,1
"Culumovic, Mr. Jeso",845,0,3
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1
"Cunningham, Mr. Alfred Fleming",414,0,2

Puedes hacer indexaci贸n parcial de columnas si las ordenas.

In [26]:
df.set_index('Name').sort_index().sort_index(axis='columns').loc["A":"B", "P":"T"].head()

,Parch,PassengerId,Pclass,Sex,SibSp,Survived
Name,,,,,,
"Abbing, Mr. Anthony",0,846,3,male,0,0
"Abbott, Mr. Rossmore Edward",1,747,3,male,1,0
"Abbott, Mrs. Stanton (Rosa Hunt)",1,280,3,female,1,1
"Abelson, Mr. Samuel",0,309,2,male,1,0
"Abelson, Mrs. Samuel (Hannah Wizosky)",0,875,2,female,1,1

##  Step 3: Filtering Rows

C贸mo se explic贸 en el apartado anterior vimos que es esposible filtrar una Serie o un DataFrame indexando con un array booleano. **Hay que tener cuidado a la hora de encadenar expresiones booleanas complejas ya que la precedencia puede generar un error no esperado.** En el ejemplo de abajo la expresi贸n comentada generar谩 un error ya que el operador `&`tine m谩s precedencia que el operador `>`.

In [27]:
#df.loc[df.Age>18 & df.Sex == "female"].sample(5) -> Est谩 evaluando df.loc[df.Age>(18 & df.Sex == "female")]
df.loc[df.Age>18 & (df.Sex == "female")].sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
549,550,1,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
56,57,1,2,"Rugg, Miss. Emily",female,21.0,0,0,C.A. 31026,10.5000,NaN,S
819,820,0,3,"Skoog, Master. Karl Thorsten",male,10.0,3,2,347088,27.9000,NaN,S
252,253,0,1,"Stead, Mr. William Thomas",male,62.0,0,0,113514,26.5500,C87,S
515,516,0,1,"Walker, Mr. William Anderson",male,47.0,0,0,36967,34.0208,D46,S

### df.query()
El m茅todo `query`es 煤nico del DataFrame y permite realizar conultas complejas con un seudo sql.

In [28]:
max18=df["Age"]>18
df.query("@max18 and Sex == 'female'").sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
670,671,1,2,"Brown, Mrs. Thomas William Solomon (Elizabeth ...",female,40.0,1,1,29750,39.0000,NaN,S
862,863,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",female,48.0,0,0,17466,25.9292,D17,S
44,45,1,3,"Devaney, Miss. Margaret Delia",female,19.0,0,0,330958,7.8792,NaN,Q
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
319,320,1,1,"Spedden, Mrs. Frederic Oakley (Margaretta Corn...",female,40.0,1,1,16966,134.5000,E34,C

## Ч Step 4: Handling Missing Data
Es com煤n contar con informaci贸n que falta al trabajar con conjuntos de datos, ya sea porque no existe, porque no se observ贸 o porque se perdi贸. Pandas usa el valor float `NaN` y `NaT`para representar valores ausentes, aunque en algun dataset puede tener sus propios "valores centinelas".

### df.isna()
Devuelve una Serie o un DataFrame con el mismo indice y columnas que el original, pero cuyos valores son booleanos indicando si el valor es *NA(not available)* o no. El m茅todo `isnull` es un alias de `isna`.

In [29]:
df.isna().sum() #Sumamos los booleanos para ver cuantos NA hay en cada columna

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [30]:
df['Age'].isna

<bound method Series.isna of 0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64>

### df.dropna()
Sirve para filtar los valores NA. Filtra sobre los nombres de los ejes dependiendo de si contienen o no valores nulos.Puede especificarse la cantidad de valores vac铆os que se permiten para ser m谩s precisos.

In [31]:
df.dropna().shape #unicamente 183 filas no tienen valores nulos

(183, 12)

In [32]:
df.dropna(how='all').shape #Podemos especificar que en vez de cualquier valor nulo, deban ser todos los valores nulos

(891, 12)

In [33]:
#Podemos espec铆ficar columans tambi茅n
#thresh indica que la columna debe tener al menos 300 valores no nulos
df.dropna(thresh=300, axis=1).shape

(891, 11)

In [34]:
df.dropna(axis=1).sample() #Elimina las columnas con valores nulos

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
168,169,0,1,"Baumann, Mr. John D",male,0,0,PC 17318,25.925

### df.fillna()
A parte de descartar los NA, tambi茅n podemos tratar de llenar los huecos.

In [35]:
df.fillna(18).info() #Usando un valor concreto

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [36]:
#Usando por ejemplo la media de la columna
#Al usarlo sobre una columna, lo estamos haciendo sobre una Serie, por lo que devolver谩 una Serie, no el DataFrame
df["Age"].fillna(df["Age"].median()).info()

<class 'pandas.core.series.Series'>
RangeIndex: 891 entries, 0 to 890
Series name: Age
Non-Null Count  Dtype
--------------  -----
891 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [37]:
df.fillna({'Age': 18, 'Embarked': 'C'}, inplace=True)#Usando un diccioanrio para un valor por columna
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

##  Step 5: Grouping and Aggregating

### df.groupby
Agrupar o pivotar la informaci贸n permite convertir en tabla la expresi贸n "obtener X por Y valor": 
- Colocar Y en el indice.
- Una columna por cada valor de X.
- Aplicar alguna transformaci贸n o de agregaci贸n si es necesario.

Esta operaci贸n divide la informaci贸n en grupos seg煤n el criterio dado y **devuelve un objeto lazy**, que no se calcula hasta que se le aplica una operaci贸n de transformaci贸n.

![Operaci贸n de agrupaci贸n](groupoperation.png)

In [38]:
# 1. Agrupamos por Edad y lugar de embarque.
# 2. Contamos el tipo de embarque para los valores de la tabla.
# 3. Usamos unstack para sacar el indice m谩s a la derecha.
# 4. Rellenamos los NaN con ceros por presentaci贸n.
df.groupby(["Age", "Embarked"])["Embarked"].count().unstack().fillna(0.0)

Embarked    C    Q    S
Age
0.42      1.0  0.0  0.0
0.67      0.0  0.0  1.0
0.75      2.0  0.0  0.0
0.83      0.0  0.0  2.0
0.92      0.0  0.0  1.0
...       ...  ...  ...
70.00     0.0  0.0  2.0
70.50     0.0  1.0  0.0
71.00     2.0  0.0  0.0
74.00     0.0  0.0  1.0
80.00     0.0  0.0  1.0

[88 rows x 3 columns]

In [39]:
df.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [40]:
df["Fare"].mean() #Computa la media a lo largo de los valores de la columna.

np.float64(32.204207968574636)

In [41]:
df["Age"].median() #Computa la mediana a lo largo de los valores de la columna.

np.float64(24.0)

##  Step 6: Sorting and Counting

### df.sort_vales()
Podemos ordenar el DataFrame por sus valores. **Esta operaci贸n no altera el indice, aunque sea num茅rico**.

In [42]:
df.sort_values("Age", ascending=False).iloc[100:105] #ordenamos por edad de mayor a menor

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
789,790,0,1,"Guggenheim, Mr. Benjamin",male,46.0,0,0,PC 17593,79.200,B82 B84,C
331,332,0,1,"Partner, Mr. Austen",male,45.5,0,0,113043,28.500,C124,S
203,204,0,3,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.225,NaN,C
187,188,1,1,"Romaine, Mr. Charles Hallace (""Mr C Rolmane"")",male,45.0,0,0,111428,26.550,NaN,S
276,277,0,3,"Lindblom, Miss. Augusta Charlotta",female,45.0,0,0,347073,7.750,NaN,S

### s.unique() y s.value_counts
Estos dos m茅todos forman parte de la clase de m茅todos que extraen informaci贸n de una Serie unidimensional. `unique` devuelve un array con los valores 煤nicos de la serie, por su parte, `value_counts` computa la frecuencia de los valores. A diferencia de `unique`, `value_counts` si que puede usarse en un DataFrame.

In [43]:
df["Embarked"].unique() #lo usamos sobre la columna

array(['S', 'C', 'Q'], dtype=object)

In [44]:
df["Embarked"].value_counts()

Embarked
S    644
C    170
Q     77
Name: count, dtype: int64

In [45]:
df.value_counts()

PassengerId  Survived  Pclass  Name                                                 Sex     Age   SibSp  Parch  Ticket    Fare     Cabin        Embarked
2            1         1       Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0  1      0      PC 17599  71.2833  C85          C           1
4            1         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)         female  35.0  1      0      113803    53.1000  C123         S           1
7            0         1       McCarthy, Mr. Timothy J                              male    54.0  0      0      17463     51.8625  E46          S           1
11           1         3       Sandstrom, Miss. Marguerite Rut                      female  4.0   1      1      PP 9549   16.7000  G6           S           1
12           1         1       Bonnell, Miss. Elizabeth                             female  58.0  0      0      113783    26.5500  C103         S           1
                                                                                                                                                           ..
872          1         1       Beckwith, Mrs. Richard Leonard (Sallie Monypeny)     female  47.0  1      1      11751     52.5542  D35          S           1
873          0         1       Carlsson, Mr. Frans Olof                             male    33.0  0      0      695       5.0000   B51 B53 B55  S           1
880          1         1       Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)        female  56.0  0      1      11767     83.1583  C50          C           1
888          1         1       Graham, Miss. Margaret Edith                         female  19.0  0      0      112053    30.0000  B42          S           1
890          1         1       Behr, Mr. Karl Howell                                male    26.0  0      0      111369    30.0000  C148         C           1
Name: count, Length: 204, dtype: int64

## 锔 Step 7: Creating or Modifying Columns

### df[k]=v
Podemos crear columnas nuevas siguiendo las l贸gicas de las listas y los diccionarios en python.

In [46]:
df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()

    Age     Fare  Fare_per_Age
0  22.0   7.2500      0.329545
1  38.0  71.2833      1.875876
2  26.0   7.9250      0.304808
3  35.0  53.1000      1.517143
4  35.0   8.0500      0.230000

### df.assign
Es una alternativa funcional a la asignaci贸n normal de columnas `df[k]=v`

In [47]:
df.assign(name_len=df["Name"].str.len()).sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_per_Age,name_len
639,640,0,3,"Thorneycroft, Mr. Percival",male,18.0,1,0,376564,16.10,NaN,S,0.894444,26
204,205,1,3,"Cohen, Mr. Gurshon ""Gus""",male,18.0,0,0,A/5 3540,8.05,NaN,S,0.447222,24
228,229,0,2,"Fahlstrom, Mr. Arne Jonas",male,18.0,0,0,236171,13.00,NaN,S,0.722222,25
405,406,0,2,"Gale, Mr. Shadrach",male,34.0,1,0,28664,21.00,NaN,S,0.617647,18
734,735,0,2,"Troupiansky, Mr. Moses Aaron",male,23.0,0,0,233639,13.00,NaN,S,0.565217,28

### df.apply
Aplica una funci贸n sobre objetos unidimensionales, ya sean las columnas o la

In [48]:
def mayordeedad(x):
    if x > 18: return "Mayor de edad"
    return "Menor de edad"
df['Age'].apply(mayordeedad)

0      Mayor de edad
1      Mayor de edad
2      Mayor de edad
3      Mayor de edad
4      Mayor de edad
           ...
886    Mayor de edad
887    Mayor de edad
888    Menor de edad
889    Mayor de edad
890    Mayor de edad
Name: Age, Length: 891, dtype: object

### pd.concat
A la hora de concatenar tablas o series en pandas hay muchas m谩s variables a tneer en cuenta fruto de la abstracci贸n del indice, pero a su vez permite una generalizaci贸nmayor de la concatenaci贸n. Pandas brinda una forma consistente de realizar esta operaci贸n mediante `concat`.

In [49]:
d1 = df["Age"]
d2 = df["Name"]
d3 = df["Sex"]

pd.concat([d1, d2, d3])[1]

1                                                 38.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
1                                               female
dtype: object

In [50]:
pd.concat([d1, d2, d3], axis=1) #por defecto el eje es el indice, pero podemos unir c贸mo columnas

      Age                                               Name     Sex
0    22.0                            Braund, Mr. Owen Harris    male
1    38.0  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2    26.0                             Heikkinen, Miss. Laina  female
3    35.0       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4    35.0                           Allen, Mr. William Henry    male
..    ...                                                ...     ...
886  27.0                              Montvila, Rev. Juozas    male
887  19.0                       Graham, Miss. Margaret Edith  female
888  18.0           Johnston, Miss. Catherine Helen "Carrie"  female
889  26.0                              Behr, Mr. Karl Howell    male
890  32.0                                Dooley, Mr. Patrick    male

[891 rows x 3 columns]

### df.merge
El m茅todo *merge* y el *join* permiten realizar uniones al estilo SQL, enlazando filas en base a una o m谩s claves. Podemos especificar las columnas clave al igual que el tipo de join, por defecto es *inner*.

In [51]:
df1=df.loc[df.Age>18]
df2=df.loc[df.Sex=="male"]

#Al compartir el mismo indice, podemos realizar el merge directamente
pd.merge(df1, df2).sample(5).sort_index()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_per_Age
27,82,1,3,"Sheerlinck, Mr. Jan Baptist",male,29.0,0,0,345779,9.5000,NaN,S,0.327586
141,339,1,3,"Dahl, Mr. Karl Edwart",male,45.0,0,0,7598,8.0500,NaN,S,0.178889
215,516,0,1,"Walker, Mr. William Anderson",male,47.0,0,0,36967,34.0208,D46,S,0.723847
268,637,0,3,"Leinonen, Mr. Antti Gustaf",male,32.0,0,0,STON/O 2. 3101292,7.9250,NaN,S,0.247656
370,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S,1.628897

In [52]:
#Podemos igualmente especificar una clave, aunque en este ejemplo no tenga mucho sentido
pd.merge(df1, df2, on="Name", suffixes=('_Mayores', '_Masculino')).sample(5).sort_index()

,PassengerId_Mayores,Survived_Mayores,Pclass_Mayores,Name,Sex_Mayores,Age_Mayores,SibSp_Mayores,Parch_Mayores,Ticket_Mayores,Fare_Mayores,...,Pclass_Masculino,Sex_Masculino,Age_Masculino,SibSp_Masculino,Parch_Masculino,Ticket_Masculino,Fare_Masculino,Cabin_Masculino,Embarked_Masculino,Fare_per_Age_Masculino
82,198,0,3,"Olsen, Mr. Karl Siegwart Andreas",male,42.0,0,1,4579,8.4042,...,3,male,42.0,0,1,4579,8.4042,NaN,S,0.200100
141,339,1,3,"Dahl, Mr. Karl Edwart",male,45.0,0,0,7598,8.0500,...,3,male,45.0,0,0,7598,8.0500,NaN,S,0.178889
157,378,0,1,"Widener, Mr. Harry Elkins",male,27.0,0,2,113503,211.5000,...,1,male,27.0,0,2,113503,211.5000,C82,C,7.833333
225,549,0,3,"Goldsmith, Mr. Frank John",male,33.0,1,1,363291,20.5250,...,3,male,33.0,1,1,363291,20.5250,NaN,S,0.621970
236,576,0,3,"Patchett, Mr. George",male,19.0,0,0,358585,14.5000,...,3,male,19.0,0,0,358585,14.5000,NaN,S,0.763158


##  Step 8: Exporting Data

Pandas implementa multiples funciones para exportar facilmente los dato a otros formatos, una de ellas es `df.to_csv`.

In [53]:
df.to_csv("titanic_cleaned.csv", index=False) #index false hace que no se guarden los nombres del indice

## З Step 9: Summary
Pandas se ha demostrado c贸mo una biblioteca muy grande, bastante m谩s que numpy y empaquetando m谩s complejidad. En este ejercicio he visto la importancia de conocer cual es la estrucutra interna de los DataFrame y c贸mo las Series son la estructura *b谩sica de todas las operaciones*; si no se es consciente de esto, junto con la abstraci贸n de los indices, algunas l贸gicas parecen arbitrarias o inconsitentes. Otra caracteristica de Pandas que, creo ver venir de la pr贸pia filosof铆a de dise帽o de python, es lo poco ortogonal que es: ha mil formas de hacer una unica cosa.

M茅todos que m谩s han destacado en esta exploraci贸n:
- loc() y todas las diferentes formas de indexaci贸n.
- groupby(), pivot_table() y las operaciones de agregaci贸n en general
- assign(), concat(), apply() y los sabores funcionales de la biblioteca.

### Referencias
- 芦API reference  pandas 2.3.3 documentation禄. Accedido 14 de noviembre de 2025. https://pandas.pydata.org/docs/reference/index.html.
- Harrison, Matt. Effective Pandas 2: Opinionated Patterns for Data Manipulation. Treading on Python Series. Matt Harrison, 2024.
- Hill, Christian. Learning Scientific Programming with Python. Second edition. Cambridge University Press, 2020.
- McKinney, Wes. Python for Data Analysis: Data Wrangling with Pandas, NumPy, and IPython. Second edition, Fourth release. OReilly, 2018.